verilog_defaults -push
verilog_defaults -add -defer
read_verilog /Users/benchoi/Projects/KandinskyPhasedArray/fpga/build/gateware/barebones_udp.v
verilog_defaults -pop
attrmap -tocase keep -imap keep="true" keep=1 -imap keep="false" keep=0 -remove keep=0

synth_ecp5  -top barebones_udp
write_json  barebones_udp.json