verilog_defaults -push
verilog_defaults -add -defer
read_verilog /Users/benchoi/Projects/KandinskyPhasedArray/fpga/cores/pdm_core.v
read_verilog /Users/benchoi/Projects/KandinskyPhasedArray/fpga/build/gateware/michub.v
verilog_defaults -pop
attrmap -tocase keep -imap keep="true" keep=1 -imap keep="false" keep=0 -remove keep=0

synth_ecp5  -top michub
write_json  michub.json